pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxInt_bf.h
/** \brief Length for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN29 */
#define IFX_INT_ACCEN_SRC_TOS0_EN29_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN29 */
#define IFX_INT_ACCEN_SRC_TOS0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN29 */
#define IFX_INT_ACCEN_SRC_TOS0_EN29_OFF (29u)

/** \brief Length for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN30 */
#define IFX_INT_ACCEN_SRC_TOS0_EN30_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN30 */
#define IFX_INT_ACCEN_SRC_TOS0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN30 */
#define IFX_INT_ACCEN_SRC_TOS0_EN30_OFF (30u)

/** \brief Length for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN31 */
#define IFX_INT_ACCEN_SRC_TOS0_EN31_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN31 */
#define IFX_INT_ACCEN_SRC_TOS0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_SRC_TOS0_Bits.EN31 */
#define IFX_INT_ACCEN_SRC_TOS0_EN31_OFF (31u)

/** \brief Length for Ifx_INT_CH_LWSR_Bits.PN */
#define IFX_INT_CH_LWSR_PN_LEN (8u)

/** \brief Mask for Ifx_INT_CH_LWSR_Bits.PN */
#define IFX_INT_CH_LWSR_PN_MSK (0xffu)

/** \brief Offset for Ifx_INT_CH_LWSR_Bits.PN */
#define IFX_INT_CH_LWSR_PN_OFF (0u)

/** \brief Length for Ifx_INT_CH_LWSR_Bits.ECC */
#define IFX_INT_CH_LWSR_ECC_LEN (5u)

/** \brief Mask for Ifx_INT_CH_LWSR_Bits.ECC */
#define IFX_INT_CH_LWSR_ECC_MSK (0x1fu)

/** \brief Offset for Ifx_INT_CH_LWSR_Bits.ECC */
#define IFX_INT_CH_LWSR_ECC_OFF (10u)

/** \brief Length for Ifx_INT_CH_LWSR_Bits.ID */
#define IFX_INT_CH_LWSR_ID_LEN (10u)

/** \brief Mask for Ifx_INT_CH_LWSR_Bits.ID */
#define IFX_INT_CH_LWSR_ID_MSK (0x3ffu)

/** \brief Offset for Ifx_INT_CH_LWSR_Bits.ID */
#define IFX_INT_CH_LWSR_ID_OFF (16u)

/** \brief Length for Ifx_INT_CH_LWSR_Bits.STAT */
#define IFX_INT_CH_LWSR_STAT_LEN (1u)

/** \brief Mask for Ifx_INT_CH_LWSR_Bits.STAT */
#define IFX_INT_CH_LWSR_STAT_MSK (0x1u)

/** \brief Offset for Ifx_INT_CH_LWSR_Bits.STAT */
#define IFX_INT_CH_LWSR_STAT_OFF (31u)

/** \brief Length for Ifx_INT_CH_LASR_Bits.PN */
#define IFX_INT_CH_LASR_PN_LEN (8u)

/** \brief Mask for Ifx_INT_CH_LASR_Bits.PN */
#define IFX_INT_CH_LASR_PN_MSK (0xffu)

/** \brief Offset for Ifx_INT_CH_LASR_Bits.PN */
#define IFX_INT_CH_LASR_PN_OFF (0u)

/** \brief Length for Ifx_INT_CH_LASR_Bits.ECC */
#define IFX_INT_CH_LASR_ECC_LEN (5u)

/** \brief Mask for Ifx_INT_CH_LASR_Bits.ECC */
#define IFX_INT_CH_LASR_ECC_MSK (0x1fu)

/** \brief Offset for Ifx_INT_CH_LASR_Bits.ECC */
#define IFX_INT_CH_LASR_ECC_OFF (10u)

/** \brief Length for Ifx_INT_CH_LASR_Bits.ID */
#define IFX_INT_CH_LASR_ID_LEN (10u)

/** \brief Mask for Ifx_INT_CH_LASR_Bits.ID */
#define IFX_INT_CH_LASR_ID_MSK (0x3ffu)

/** \brief Offset for Ifx_INT_CH_LASR_Bits.ID */
#define IFX_INT_CH_LASR_ID_OFF (16u)

/** \brief Length for Ifx_INT_CH_ECR_Bits.PN */
#define IFX_INT_CH_ECR_PN_LEN (8u)

/** \brief Mask for Ifx_INT_CH_ECR_Bits.PN */
#define IFX_INT_CH_ECR_PN_MSK (0xffu)

/** \brief Offset for Ifx_INT_CH_ECR_Bits.PN */
#define IFX_INT_CH_ECR_PN_OFF (0u)

/** \brief Length for Ifx_INT_CH_ECR_Bits.ECC */
#define IFX_INT_CH_ECR_ECC_LEN (5u)

/** \brief Mask for Ifx_INT_CH_ECR_Bits.ECC */
#define IFX_INT_CH_ECR_ECC_MSK (0x1fu)

/** \brief Offset for Ifx_INT_CH_ECR_Bits.ECC */
#define IFX_INT_CH_ECR_ECC_OFF (10u)

/** \brief Length for Ifx_INT_CH_ECR_Bits.ID */
#define IFX_INT_CH_ECR_ID_LEN (10u)

/** \brief Mask for Ifx_INT_CH_ECR_Bits.ID */
#define IFX_INT_CH_ECR_ID_MSK (0x3ffu)

/** \brief Offset for Ifx_INT_CH_ECR_Bits.ID */
#define IFX_INT_CH_ECR_ID_OFF (16u)

/** \brief Length for Ifx_INT_CH_ECR_Bits.EOVCLR */
#define IFX_INT_CH_ECR_EOVCLR_LEN (1u)

/** \brief Mask for Ifx_INT_CH_ECR_Bits.EOVCLR */
#define IFX_INT_CH_ECR_EOVCLR_MSK (0x1u)

/** \brief Offset for Ifx_INT_CH_ECR_Bits.EOVCLR */
#define IFX_INT_CH_ECR_EOVCLR_OFF (28u)

/** \brief Length for Ifx_INT_CH_ECR_Bits.STATCLR */
#define IFX_INT_CH_ECR_STATCLR_LEN (1u)

/** \brief Mask for Ifx_INT_CH_ECR_Bits.STATCLR */
#define IFX_INT_CH_ECR_STATCLR_MSK (0x1u)

/** \brief Offset for Ifx_INT_CH_ECR_Bits.STATCLR */
#define IFX_INT_CH_ECR_STATCLR_OFF (29u)

/** \brief Length for Ifx_INT_CH_ECR_Bits.EOV */
#define IFX_INT_CH_ECR_EOV_LEN (1u)

/** \brief Mask for Ifx_INT_CH_ECR_Bits.EOV */
#define IFX_INT_CH_ECR_EOV_MSK (0x1u)

/** \brief Offset for Ifx_INT_CH_ECR_Bits.EOV */
#define IFX_INT_CH_ECR_EOV_OFF (30u)

/** \brief Length for Ifx_INT_CH_ECR_Bits.STAT */
#define IFX_INT_CH_ECR_STAT_LEN (1u)

/** \brief Mask for Ifx_INT_CH_ECR_Bits.STAT */
#define IFX_INT_CH_ECR_STAT_MSK (0x1u)

/** \brief Offset for Ifx_INT_CH_ECR_Bits.STAT */
#define IFX_INT_CH_ECR_STAT_OFF (31u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXINT_BF_H */
